## Intermediate Notebook

Welcome back to the second half of your adventure with SQL! By now, you should be comfortable with writing simple queries and selecting attributes from a table based on certain conditions. If at any point you feel like you need to review, take a breather and jump back into the beginner notebook to refresh. 

In this section you'll be exploring SQL joins and how to merge tables in a relational database. Let's jump right into it!

## What is a join?

When broken down, the mechanics of a join are pretty straightforward.  To perform a join you need two items: two tables and a join condition.  The tables contain the rows to be combined, and the join condition the instructions to match rows together. A common join pattern you’ll come across is joining the primary key of one table to its foreign key.  

### What process do we use to break up our data?

If you guessed normalization, you are correct.  Through that process we break up dependencies within tables to eliminate update anomalies among other things, but in order to keep relationships, we introduce foreign keys.

Let’s take an example from the sample database.  Consider the following data model involving the Employees and Orders table.  In this model each employee can place zero or more orders. The EmployeeID is the primary key in the Employees table and foreign key in the Orders table.  For each employee there can be none, one, or perhaps many orders.

![](img/Joining-Tables-Data-Model.png)

Check the following diagram.  We join the table together we are looking for rows where the EmployeeID matches.  So, for every order, where the EmployeeID = 4, the database will match to the Employees table and match to the corresponding row. In this case that is the employee whose last name is “Baker.”

![](img/Inner-Join-In-Action.png)

This type of join is called an inner join and we'll go through the explanation in detail later, but if you are dying to try it now, here is the command!

### Mac

In [2]:
-- connection: postgresql://localhost:5432/northwind

Failed to connect to a database at postgresql://localhost:5432/northwind

### Windows

In [ ]:
-- connection: host='localhost' dbname='northwind' user='postgres' password='postgres'

In [ ]:
SELECT Employees.LastName, Orders.ShippedDate
FROM Employees
INNER JOIN Orders ON Employees.EmployeeID = Orders.EmployeeID

## Types of Joins

There are four main types of joins: inner joins, outer joins, left joins, and right joins. We will see how each of the joins combines tables.

### Inner Joins

In an inner join, the final table only contains rows that have matching columns in both tables. An important thing to note is that for inner joins, if a row doesn't have a matching value in the other table, the row is not included in the final result.

![](img/innerjoin.png)

To write an inner join we need to use the following syntax:

```
SELECT ...
FROM <TABLE_1>
    INNER JOIN <TABLE_2>
    ON <...>
```

Say we had the following two tables:

**Table A**

id | firstName | lastName |
--- |---| --- |
1 | Andie | Donovan |
2 | Shon | Inouye|
3 | Myranda | Flores. |
6 | Eileen | Zhu |

**Table B**

id2 | age | place |
--- |---| --- |
1 | 21 | Del Playa |
2 | 22 | Sabado |
3 | 21 | Pasado |
5 | 19 | Sueno |

An inner join would lead to a table of this result:

```
SELECT TableA.firstName,TableA.lastName,TableB.age,TableB.place
FROM TableA
INNER JOIN TableB
ON TableA.id = TableB.id2;
```

|id|firstname| firstName | age | Place
|---|--- |---| --- |---|
|1|Andie | Donovan |21| Del Playa|
|2|Shon | Inouye|22|Sabado|
|3|Myranda | Flores |21|Pasado|

The join has returned the intersection of the two tables (i.e., where id and id2 both have 1, 2, and 3).

So for example, if we want to join the Orders table with the Order_Details, we need to write:

In [ ]:
SELECT * 
FROM Orders AS O
    INNER JOIN Order_Details AS OD
    on O.orderid = OD.orderid;

This is where aliasing comes in handy. You need to join the tables on a common attribute in both tables (in this case, the order ID). As the queries you build become more complex, it is simpler to alias the tables with a single letter whenever you reference them during joins.

### Full/Outer Join

In a full join (sometimes called an outer join), all records from both tables are included in the joined table. If a row doesn't have a match in the other table, the missing values are filled in with NULL.

![](img/outerjoin.png)

As before, we join the Orders and Order Details tables together to match the order types with its details. A full join comes in handy because we want to keep all rows in either table even if there isn't a match.

If we wrote a query with a full join about our example Table A and Table B from earlier, the resulting table would look like:

```
SELECT TableA.firstName,TableA.lastName,TableB.age,TableB.Place
FROM TableA
FULL JOIN TableB
ON TableA.id = TableB.id2
```

|id|firstname| firstName | age | Place
|---|--- |---| --- |---|
|1|Andie | Donovan |21| Del Playa|
|2|Shon | Inouye|22|Sabado|
|3|Myranda | Flores |21|Pasado|
|5|Eileen | Zhu |NULL|NULL|
|6|NULL | NULL |19|Sueno|

Since this is a full join, we are returning every row in both tables. The tables that don't have columns in the other tables returns a `NULL` value. 

**Note:** For any query OTHER than an inner join, the order matters. 
Now let's see how it looks in our example database:

In [ ]:
SELECT * 
FROM Orders AS O
    FULL JOIN Order_Details AS OD
    on O.orderid = OD.orderid

### Left Join

In a left join, all records from the left table are included in the joined table. If a row doesn't have a match in the right table, the missing values are filled in with NULL.

![](img/left_join.png)

This time, we want to keep all the order details even if an order doesn't have a matching ID.

To write an left join in SQL, we modify our FROM clause to use the following syntax:

```
SELECT TableA.firstName,TableA.lastName,TableB.age,TableB.Place
FROM TableA
LEFT JOIN TableB
ON TableA.id = TableB.id2;
```

|id|firstname| firstName | age | Place
|---|--- |---| --- |---|
|1|Andie | Donovan |21| Del Playa|
|2|Shon | Inouye|22|Sabado|
|3|Myranda | Flores |21|Pasado|
|5|Eileen | Zhu |NULL|NULL|

We are trying to obtain all the selected rows in Table A, plus any common rows in Table B.

And in our database:

In [ ]:
SELECT * 
FROM Orders AS O
    LEFT JOIN Order_Details AS OD
    on O.orderid = OD.orderid;

### Right Join

In a right join, all records from the right table are included in the joined table. If a row doesn't have a match in the right table, the missing values are filled in with NULL.

![](img/right_join.png)

The right joined example table looks like so:

|id|firstname| firstName | age | Place
|---|--- |---| --- |---|
|1|Andie | Donovan |21| Del Playa|
|2|Shon | Inouye|22|Sabado|
|3|Myranda | Flores |21|Pasado|
|6|NULL | NULL |19|Sueno|

How do you think a right join SQL query is written? Go ahead and try it out down below! Use the same two Northwind database tables we used earlier.

You may notice that a right join produces the same result a left join with the table order swapped. That is, names left joined with colors is the same as colors right joined with names. Because of this, some SQL engines do not support right joins.


We have covered the four main types of SQL joins: inner, full, left, and right joins. We use all four joins to combine information in separate relations, and each join differs only in how it handles non-matching rows in the input tables.

### Practice

What is the number of orders from each company? Alias the Order id as NumberOfOrders and group by the company name. 

**(Hint: Use a left join and COUNT here.)**

Output the employees with the last name "Davolio" or "Fuller"  who have registered more than 25 orders. Alias the Order id as NumberOfOrders and group by the last name.

### Implicit Inner Joins

Just like there are multiple ways to solve a problem, there are typically multiple ways to accomplish the same task in SQL. Here is one other method for writing an inner join that appears in practice called an `implicit join`. Recall that we previously wrote the following to conduct an inner join:

In [ ]:
SELECT * 
FROM Orders AS O
    INNER JOIN Order_Details AS OD
    on O.orderid = OD.orderid;

An implicit inner join has a slightly different syntax. Notice in particular that the FROM clause uses a comma to select from two tables and that the query includes a WHERE clause to specify the join condition.


When multiple tables are specified in the FROM clause, SQL creates a table containing every combination of rows from each table. This operation is often called a `Cartesian product`: each row in the first table is paired with every row in the second table. The additional WHERE clause in the implicit join filters out rows that do not have matching orderid values.

For example:

In [ ]:
SELECT *
FROM Orders AS O, Order_Details AS OD
WHERE O.orderid = OD.orderid;

### Joining Three Tables

Just as you can join two tables, you can easily join three! Here, we join the order ID from the Orders table with the Company Name from the Customers table, and the first and last name of the employee from the Employees table.

In [ ]:
SELECT Orders.OrderID, Customers.CompanyName, Employees.LastName, Employees.FirstName
FROM ((Orders
        INNER JOIN Customers ON Orders.CustomerID = Customers.CustomerID)
        INNER JOIN Employees ON Orders.EmployeeID = Employees.EmployeeID);

### The SQL UNION Operator

The UNION operator is used to combine the result-set of two or more SELECT statements.

Each SELECT statement within UNION must have the same number of columns. The columns must also have similar data types and the columns in each SELECT statement must also be in the same order.

### UNION ALL Syntax
The UNION operator selects only distinct values by default. To allow duplicate values, use UNION ALL. 

Here's a snippet from both the Customers table and the Suppliers table.

In [ ]:
SELECT CustomerID, ContactName, Address, City, PostalCode, Country
FROM Customers
LIMIT 3;

In [ ]:
SELECT SupplierID, ContactName, Address, City, PostalCode, Country
FROM Suppliers
LIMIT 3;

The following query selects all the different cities (only distinct values) from "Customers" and "Suppliers":

In [ ]:
SELECT City FROM Customers
UNION
SELECT City FROM Suppliers
ORDER BY City;

**Note**: If some customers or suppliers have the same city, each city will only be listed once, because UNION selects only distinct values. Use UNION ALL to also select duplicate values!

In [ ]:
SELECT City FROM Customers
UNION ALL
SELECT City FROM Suppliers
ORDER BY City;

### Practice Questions

What are the supplier IDs that match in both the Products table and the Suppliers table?

What is the customer address, order date, and employee notes on Order ID `10481`? Use an inner join.

What is the max quantity of the Sasquatch Ale product? Use an implicit inner join.

## Creating Databases

Just as important as operating databases is creating them. 

For this workshop, we’re going to design a movies database. Each movie has a title and year, one (and only one) director, and some number of actors. Actors can star in multiple movies. Directors can direct multiple movies. Some movies have the same title such as `Ocean’s Eleven` (the 2001 version directed by Steven Sodenbergh had George Clooney, Brad Pitt, Matt Damon, Julia Roberts, and many others, but the 1960 version was directed by Lewis Milestone and starred Frank Sinatra, Dean Martin and Sammy Davis Jr).

The schema should be normalized enough to avoid duplicating strings too much, and also to be able to efficiently answer questions like these two:

- Who acted in Fight Club (1999)?
- What are the 10 most recent movies that George Clooney starred in?

Use your judgement about what a good answer is in terms of what to name the tables, what keys they should have. To be consistent, always keep in mind:

- How many tables?
- What are the names of the tables?
- What are the names of each column in those tables? What are the types of each column?

####  Schema design
One possible answer (and there are many others that are acceptable):


movie | person | movie_actor |
--- |---| --- |
id (integer) | id (integer) | actor_id (integer) |
title (char) | name (char) | movie_id (integer) |
year (integer)| | |
director_id (integer) || |

This is what we're going to build today!

### The SQL CREATE DATABASE Statement

The first thing we'll need to make is the actual database. This is done with the `CREATE DATABASE` statement. For the sake of the tutorial, we'll be building on the Northwind database we have already.

To create a database, the syntax looks like:

**CREATE DATABASE name;**

### The SQL CREATE TABLE Statement

The tables live inside the database. This is done with the `CREATE TABLE` statement is used to create a new table in a database. The syntax looks like:

```
CREATE TABLE table_name (
    column1 datatype,
    column2 datatype,
    column3 datatype,
   ....
);
```

The column parameters specify the names of the columns of the table and the datatype parameter specifies the type of data the column can hold (e.g. varchar, integer, date, etc.).

So if we wanted to make a table about the movie actor...

In [ ]:
CREATE TABLE IF NOT EXISTS movie_actor (
    actor_id int,
    name varchar(255)
);

The actor_id column is of type int and will hold an integer. The name column is of type varchar and will hold characters, and the maximum length for these fields is 255 characters.

Once you've created the table, you don't need to worry about losing this data. It exists in your database and is free for you to write all the queries in the world! Now, to make this table useful, we'll need to input our own data.

### SELECT INTO Statement

For now, the table is empty. One way to remedy this is to copy data from one table into another. This can be done with the `SELECT INTO` statement. For example, if we wanted to duplicate the data from the Employees table into the movie_actor table, we would write:

In [ ]:
SELECT *
INTO movie_actor 
FROM Employees;

In [ ]:
SELECT * FROM movie_actor;

### ALTER TABLE Statement

The ALTER TABLE statement is used to add, delete, or modify columns in an existing table. This is also used to add and drop various constraints on an existing table.

#### ALTER TABLE - ADD Column
To add a column in a table, use the following syntax:

```
ALTER TABLE table_name
ADD column_name datatype;
```

In [ ]:
ALTER TABLE movie_actor
ADD dateofbirth int;

In [ ]:
SELECT *
FROM movie_actor;

If you scroll to the far right, there is our added column! Don't try to do anything with it though - there is nothing actually in it. 

#### ALTER TABLE - DROP COLUMN
To delete a column in a table, use the following syntax:
```
ALTER TABLE table_name
DROP COLUMN column_name;
```

In [ ]:
ALTER TABLE movie_actor
DROP COLUMN notes;

In [ ]:
SELECT * 
FROM movie_actor;

Can you still see the notes column?

### Truncating table 

Now, we know that employee data isn't relevant to movie data. If we want to delete the data inside the table, we will use the Truncase statement.

In [ ]:
TRUNCATE TABLE movie_actor;

Run the query down below to check that the deletion worked.

In [ ]:
SELECT * FROM movie_actor;

### Primary Key

The PRIMARY KEY constraint uniquely identifies each record in a database table. Primary keys must contain UNIQUE values, and cannot contain NULL values. This is what we referenced to join our tables on earlier. 

A table can have only one primary key, which may consist of single or multiple fields.

#### SQL PRIMARY KEY on CREATE TABLE
The following SQL creates a PRIMARY KEY on the "ID" column when the Persons table is created:

In [ ]:
CREATE TABLE IF NOT EXISTS persons (
    ID int NOT NULL PRIMARY KEY,
    name varchar(255)
);

### FOREIGN KEY Constraint

A FOREIGN KEY is a key used to link two tables together. A FOREIGN KEY is a field (or collection of fields) in one table that refers to the PRIMARY KEY in another table.

The table containing the foreign key is called the child table, and the table containing the candidate key is called the referenced or parent table.

If we jump back to the Northwind database we've been working on and look at the following two tables:

In [ ]:
SELECT * 
FROM Orders;

In [ ]:
SELECT *
FROM Order_Details;

Notice that the "OrderID" column in the Orders table points to the "OrderID" column in the Order_Details table.

The OrderID column in the Orders table is the `PRIMARY KEY`.

The "OrderID" column in the Order_Details table is the `FOREIGN KEY`.

The FOREIGN KEY constraint is used to prevent actions that would destroy links between tables and invalid data from being inserted into the foreign key column, because it has to be one of the values contained in the table it points to.

If we want to create a foreign key when we create a table (and the last component of our database), it looks like so:

In [ ]:
CREATE TABLE IF NOT EXISTS movie (
    ID int NOT NULL PRIMARY KEY,
    title varchar(255),
    year int NOT NULL,
    director_id int REFERENCES persons(ID)
);

Whew! You just added to your first database! Let's see how it looks. Run the command down below to see all the tables that now exist in Northwind. You should be able to see `movie`, `movie_actor`, and `persons` in there now.

In [ ]:
SELECT * 
FROM information_schema.tables 
WHERE table_schema='public';

## Woohoo!

Give yourself a pat on the back. You've made it to the end of the UCSB SQL Workshop. We've covered a lot today, and we hope you have learned something about using SQL to navigate and manage databases. To review, you should now have the capabilities to write detailed queries and join multiple tables to obtain the information you need to complete your analysis. 

Not too shabby for a day's work!

### What's next? 

Take a break and relax. You've just completed something huge. If you're itching for some more, included in this curriculum is some further practice, and applications related to SQL that you can work with.  

For now, here's some problems that you can solve before we finish up the workshop. The coaches will be wrapping up at 4 pm, so sit tight!

### Extra Practice

What does the query look like for this table? 


productid | quantity | quantityperunit |
--- |---| --- |
11 | 12 | 1 kg pkg. |
42 | 10 | 32 - 1 kg pkgs.

What are the notes on all the company names where the freight is between `620` and `780`?

**(Hint: This requires joining 3 tables.)**

What are the addresses of the customers and employees who live in the USA? Alias the customer address as Customer_Address and the employee address as Employee_Address.

What are the company names and phones that are in both the Customers table and the Suppliers table? List them alphabetically by company name.

What is the description for the product `Louisiana Hot Spiced Okra`? What is the category name?

Create a table of your choice with an ID as a `primary key` and at least two `varchar` attributes. Copy the contents of the `Shippers` table in there and add a column called `Address`. Delete the `Phone` column. 


Check the `information_schema` to see if your table exists there.